import random

print("""_________________________________________________________________________________________________

        წარმოგიდგენთ თამაშის რეპლიკას - WORDLE.
_________________________________________________________________________________________________
        Rules: 
        
        გამოცნობის გასაადვილებლად სისტემას გამოაქვს ფერები:  მწვანე - სწორ პოზიციაზე მყოფი ასო,
                                                             ყვითელი - არასწორ პოზიციაზე,
                                                             ნაცრისფერი - არარსებული ასო.
                                                             _________________________________________""")

print("""
გაქვთ 6 ცდა იმისთვის რომ გამოიცნოთ 5 ასოიანი სიტყვა

1]|_|_|_|_|_|
2]|_|_|_|_|_|
3]|_|_|_|_|_|
4]|_|_|_|_|_|
5]|_|_|_|_|_|
6]|_|_|_|_|_|
""")

with open("Ka2.txt", "r") as f:
    wholetext = f.read()
    words = list(map(str, wholetext.split()))

word_to_guess = random.choice(words)
print(word_to_guess)

temp = 0
while temp != 6:
    inp = input("შეიყვანეთ სიტყვა: ")
    temp += 1

    if len(inp) <= 5:
        for i in inp:
            for letter in word_to_guess:
                if i == letter:
                    print(i, "არის ყვითელი ")

    else:
        print("მაქსიმუმ 5 ასოიანი სიტყვა!!!,ერთი ცდით ნაკლები გაქვს :) ")
        temp += 1

    # indexing
    zero = inp[0]
    first = inp[1]
    second = inp[2]
    third = inp[3]
    fourth = inp[4]
